package com.example.demo;

import java.util.HashMap;

public class Animal {
    HashMap<String,String> animals = new HashMap<>();

    public  Animal() {
        animals.put("корова", "У коров есть лучшие подружки.");
        animals.put("белка", "Миллионы деревьев вырастают каждый год, благодаря тому, что белки забывают, куда спрятали свои орехи.");
        animals.put("выдра", "Выдры держатся за лапки во время сна, чтобы их не разлучило течением.");
        animals.put("кит", "Горбатые киты могут петь. Ученые доказали, что во время брачного сезона «поющие» звуки эволюционируют с каждым годом и даже передаются через поколения.");
        animals.put("пингвин", "Папуанские пингвины делают предложение своей даме сердца с помощью камешка.");
        animals.put("морской конек", "Морские коньки моногамны и всю жизнь живут с одним партнером. Они передвигаются, сцепившись хвостами.");
        animals.put("собака", "Щенки мужского пола специально дают девочкам-щенкам выигрывать в игривых драках, чтобы узнать их получше.");
        animals.put("кот","Нос каждого кота имеет уникальный узор, совсем как человеческий отпечаток пальца.");
        animals.put("дельфин","Дельфины знают свои — придуманные самостоятельно — имена, знают, как зовут  друзей и знакомых. Знакомясь, представляются. И потом обращаются друг к другу по именам.");
        animals.put("крыса","Крысы умеют смеяться.");
        animals.put("мышь","Есть крошечные мыши, которые спят внутри цветов.");
        animals.put("ворона","Вороны могут помнить лица, и вы можете подружиться с ними, если прикормите.");

    }
}
